brew "python" # Python, better install it before others
brew "Libxmlsec1" # python xmlsex need this one
# Install GNU core utilities (those that come with OS X are outdated).
# List of all utils: https://en.wikipedia.org/wiki/List_of_GNU_Core_Utilities_commands
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`
brew "gnu-sed" # GNU `sed`, overwriting the built-in `sed`
brew "openssh"
brew "openssl@1.1" # python 2.7
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"
brew "tmux"
brew "gcc"
brew "make"


brew "gnupg"  # Install GnuPG to enable PGP-signing commits.

# Process managers
brew "htop" # Better top
brew "glances" # Nice monitoring tools (better htop)
brew "btop" # Like glances but useful in some other situations
brew "ctop" # Htop but for docker containers

brew "vim"
brew "nano"

brew "httpie" # HTTP client
brew "fzf" # Command line fuzzy finder
brew "jq" # JSON processort
brew "grep"
brew "wget"
brew "curl"
brew "bat" # Better 'cat' with syntax highlighting
brew "fd" # Better 'find' - faster
brew "ripgrep" # Better 'grep'
brew "ncdu" # Nice disk usage analyzer
brew "tldr" # Gives nice TLDR from man pages
brew "tree"  # Tree of folder's structure
brew "trash"  # Moves to trash instead of removing completely - use it with "rm" alias
brew "terminal-notifier"  # Nice notifications from the terminal

brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-delta" # Better git-diff (replaces diff-so-fancy)
brew "gh" # Github CLI
brew "glab" # GitLab CLI

brew "ispell"
brew "ag"
brew "ack"
brew "colordiff"

brew "litecli" # Better SQLite CLI
brew "libpq" # PostgeSQL client, needs to be added to the path

brew "wifi-password" # Get the password of the WiFi you're on.

brew "starship" # better prompt management

brew "asdf"
brew "pipx"


# Fonts
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# Apps
brew "mas" # Mac App Store command line interface 

cask "mattermost" # chat
cask "1password"
cask "1password/tap/1password-cli"
cask "alacritty"
cask "appcleaner"
cask "captin" # Displays the status of capslock key
cask "carbon-copy-cloner" # disk backup and cloning
cask "clickup" # project management
cask "discord" # chat
cask "dozer" # Hide menubar items
cask "firefox"
cask "google-chrome"
cask "grammarly"
cask "imagealpha" # Image optimizer
cask "imageoptim" # Image optimizer
cask "inkscape" # SVG editor
cask "karabiner-elements" # karabiner for mapping multiple keys to one
cask "keycastr"  # keystroke visualizer
cask "obsidian"
cask "docker"
# cask "rancher" # replace docker for mac
cask "rectangle" # Window manager
cask "slack" # chat
cask "visual-studio-code"
cask "zoom" # Video conferencing

# brew "docker"
brew "docker-compose"
brew "kubernetes-cli" # kubectl
brew "kubectx" # Faster way to switch between clusters and namespaces in kubectl 
