# Install GNU core utilities (those that come with OS X are outdated).
# List of all utils: https://en.wikipedia.org/wiki/List_of_GNU_Core_Utilities_commands
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`
brew "gnu-sed" # GNU `sed`, overwriting the built-in `sed`
brew "openssh"
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"
brew "tmux"
brew "gcc"
brew "make"
brew "bash"


brew "gnupg"  # Install GnuPG to enable PGP-signing commits.

# Process managers
brew "htop" # Better top
brew "glances" # Nice monitoring tools (better htop)
brew "btop" # Like glances but useful in some other situations
brew "ctop" # Htop but for docker containers

brew "vim"
brew "nano"
brew "neovim"

brew "stow" # dotfile management
brew "httpie" # HTTP client
brew "fzf" # Command line fuzzy finder
brew "jq" # JSON processort
brew "grep"
brew "wget"
brew "curl"
brew "bat" # Better 'cat' with syntax highlighting
brew "fd" # Better 'find' - faster
brew "eza" # Better ls
brew "zoxide" # Better cd
brew "ripgrep" # Better 'grep'
brew "ncdu" # Nice disk usage analyzer
brew "tldr" # Gives nice TLDR from man pages
brew "tree"  # Tree of folder's structure
brew "direnv" # Load environments variables depending on directory
brew "yazi" # Terminal file manager

brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-delta" # Better git-diff (replaces diff-so-fancy)
brew "gh" # Github CLI
brew "glab" # GitLab CLI

brew "ispell"
brew "ag"
brew "ack"
brew "colordiff"

brew "litecli" # Better SQLite CLI
brew "libpq" # PostgeSQL client, needs to be added to the path

brew "starship" # better prompt management

brew "cairo"
brew "graphviz" # required by pydot

brew "hugo" # Static site generator

# GPG: https://github.com/microsoft/vscode/wiki/Commit-Signing
brew "gpg2"
brew "gnupg"
brew "pinentry-mac"

# Fonts
cask "font-hack-nerd-font"

cask "mattermost" # chat
cask "1password"
cask "wezterm"
cask "appcleaner"
cask "calibre" # ebook libra qqry
cask "carbon-copy-cloner" # disk backup and cloning
cask "discord" # chat
cask "figma"
cask "firefox"
cask "google-chrome"
cask "imageoptim" # Image optimizer
cask "inkscape" # SVG editor
cask "keycastr"  # keystroke visualizer
cask "obsidian"
cask "docker"
cask "rectangle" # Window manager
cask "slack" # chat
cask "zoom" # Video conferencing

brew "docker-compose"
brew "kubernetes-cli" # kubectl
brew "kubectx" # switch between clusters and namespaces in kubectl
brew "kubeseal"
brew "helm"
brew "kind" # tool for running local Kubernetes clusters using Docker container
cask "google-cloud-sdk"
brew "pyenv"

brew "FelixKratz/formulae/sketchybar"
brew "FelixKratz/formulae/borders"
cask "nikitabobko/tap/aerospace"
